# Написать программу сложения двух чисел.

# x = int(input('x='))
# y = int(input('y='))
# print(x+y)


# def sum(a: int, b: int):
#     return a+b


# r = sum(12, 5)


# def sum(a, b): return a+b
